# LinearArray Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinearArray Class
Members See Also
---
An object that represents an Array created linearly within the Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LinearArray : BaseArray
```

Visual Basic
---
```text
Public Class LinearArray _
	Inherits BaseArray
```

Visual C++
---
```text
public ref class LinearArray : public BaseArray
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..BaseArray Autodesk.Revit.DB..::..LinearArray
# See Also
LinearArray Members
Autodesk.Revit.DB Namespace